Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Then, for each prompt in turn, the client SHOULD display the prompt and read the user input.
ja: そして, 順番にそれぞれのpromptについて, クライアントは promptを表示しユーザの入力を読み取る必要がある.

source: Method .....................................................2 2.2.
ja: 方法 .....................................................2 2.2.

source: o Generic Message Exchange Authentication [RFC4256] is a general purpose authentication method for the SSH protocol, suitable for interactive authentications where the authentication data should be entered via a keyboard.
ja: o 一般メッセージ交換認証 [RFC4256] は, SSHプロトコルのための汎用の認証法だ. この認証法は, 認証データをキーボードで入力する状況でインタラクティブな認証を行なうのに適している.

source: Names
ja: 名前

source: The purpose of this document is to draw upon all of these documents to provide guidance for Suite B compliant implementations of Secure Shell (hereafter referred to as "SecSh-B").
ja: この文書の目的は, セキュアシェルの Suite B 準拠実装 (以後 "SecSh-B" と呼ばれる) へのガイダンスを提供するために, これらの文書のすべてを活用することだ.

source: Either party MAY initiate the re-exchange, but roles MUST NOT be changed (i.e., the server remains the server, and the client remains the client).
ja: どちらの側も, 鍵の再交換を始めてもよい. ただし, 役割を変更してはならない (すなわち, サーバはサーバのままでクライアントはクライアントのままでなければならない).

source: It is implementation-dependent when a session should be closed.
ja: いつセッションが終了される必要があるかは, 実装依存だ.

source: This document defines two ExtendedKeyUsage key purpose IDs that MAY be used to restrict a certificate's use: id-kp-secureShellClient, which indicates that the key can be used for a Secure Shell client, and id-kp-secureShellServer, which indicates that the key can be used for a Secure Shell server.
ja: この文書は, 証明書の利用を制限するために利用されてもよい 2つの ExtendedKeyUsage 鍵目的 ID を定義する: id-kp-secureShellClient, 鍵が利用されるセキュアシェルクライアントを指定, と id-kp-secureShellServer, 鍵が利用されるセキュアシェルサーバを指定, だ.

source: Each line in the header MUST NOT be more than 72 8-bit bytes.
ja: ヘッダの各行は 72 8-bit バイトを越えてはならない.

source: Service Request ...............................................24 11.
ja: サービスの要求.....................................24 11.

source: Host-Based Authentication
ja: ホストベース認証

source: Information Requests
ja: 情報の要求

source: Conventions Used in This Document ...............................2 3.
ja: この文書で用いる表記 ...............................2 3.

source: Headers with header-tags beginning with "x-" are reserved for private use.
ja: "x-" で始まる header-tag を持つヘッダは私的利用のために予約されている.

source: This document describes a mechanism for creating a short text string that uniquely represents a particular public key, called fingerprinting.
ja: この文書で, 特定の公開鍵を一意に表現する, 指紋と呼ばれる短い文字列を生成するメカニズムを記述する.

source: When used, special care SHOULD be taken to prevent a regular user from obtaining the private host key.
ja: この認証法が使われる場合は, 一般ユーザがホストの秘密鍵を得られないようにする特別の注意が払われる必要がある.

source: When values to fill those fields are referenced, they will appear within double quotes.
ja: フィールドに入る値が参照される場合は, ダブルクォートで囲まれて表記される.

source: However, during the authentication protocol, it is not known whether the user will be accessing files, attempting to use an interactive shell, or even both.
ja: しかし, ユーザがファイルにアクセスするかインタラクティブなシェルを使うか, その両方かは, 認証プロトコルの間にはわからない.

source: However, they also state that this problem does not apply to safe primes.
ja: しかし, この問題は安全な素数には適用されないことを彼らは述べている.

source: All names registered by the IANA in the following sections MUST be printable US-ASCII strings, and MUST NOT contain the characters at-sign ("@"), comma (","), or whitespace or control characters (ASCII codes 32 or less).
ja: 以降の節のIANAによって登録されるすべての名前は, 表示可能なUS-ASCIIの文字列で,アットマーク("@"), コンマ (","), スペース, 制御文字(ASCIIコード 32以下) を含んではならない.

source: The "aes128-cbc" cipher is the same as above, but with a 128-bit key.
ja: "aes128-cbc" 暗号は, 同様の暗号だが, 128-bit の鍵を使う.

source: The Secure Shell protocol (SSH) is a protocol for secure remote login and other secure network services over an insecure network.
ja: セキュア シェル (SSH) プロトコルは, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: Connection Protocol Channel Types ..................14 4.9.2.
ja: コネクションプロトコルのチャンネルのタイプ.....14 4.9.2.

source: o Changed use of the terms "client/server" and "manager/agent" to "SSH client/server" and "NETCONF client/server".
ja: o "クライアント/サーバ" と "マネージャ/エージェント"という用語法を "SSH クライアント/サーバ" と "NETCONF クライアント/サーバ" に変更した.

source: The examples for the chunked framing mechanism show all LineFeeds, even those that are not used as part of the framing mechanism.
ja: チャンクされたフレーミングメカニズムの例ではすべてのラインフィードを示している. ただし, フレーミングメカニズムの一部としてはラインフィードは利用されていない.

source: The following table lists the initial assignments to the Connection Protocol Type and Request names.
ja: 次の表で, コネクションプロトコルのタイプとリクエスト名の初期の割り当てを示す.

source: The REQUIRED curves in Section 10 were all generated verifiably pseudorandomly.
ja: 10節の必須の曲線は, すべて検証できる疑似乱数で生成されている.

source: Manageability Considerations
ja: 管理の上での考慮

source: Mechanism OIDs are encoded according to the ASN.1 Distinguished Encoding Rules (DER), as described in [ASN1] and in Section 3.1 of
ja: メカニズムの OID は [ASN1] と [GSSAPI]の3．1節で記述されているように ASN.1 Distinguished Encoding Rules (DER) に従ってエンコードされる．

source: DESCRIPTION "Represents either a hostname or IP address, along with a port number and an optional user name.
ja: DESCRIPTION "ポート番号とオプションのユーザ名と共に, ホスト名かIPアドレスを表す.

source: C verifies that K_S really is the host key for S (e.g., using certificates or a local database).
ja: C は, K_S が本当に S のホスト鍵かを検証する(例えば, 証明書やローカルなデータベースを用いて).

source: o min and max are the minimal and maximal sizes of p in bits that are acceptable to the client
ja: o min と max は クライアントが許容できる p の bit での最小値と最大値

source: This information can reflect the configured capabilities of a remote SSH server, which could be helpful to an attacker for focusing an attack.
ja: この情報は, リモートの SSH サーバの設定された情報を反映する. 攻撃者が攻撃に集中するために有益な可能性がある.

source: It is never reset, even if keys/algorithms are renegotiated later.
ja: これはけっしてリセットされない. たとえ鍵やアルゴリズムが再度取り決められた後でもだ.

source: As an example, consider the following case:
ja: 例として 次の場合を考える:

source: The terms "manager" and "agent" are used to refer to the two ends of the NETCONF protocol session.
ja: 用語 "マネージャ" と "エージェント" は, NETCONF プロトコルセッションの両端を差すのに用いる.

source: A party need not explicitly request forwardings from its own end to the other direction.
ja: 自身のポートを相手側に転送する場合は要求を明示的にする必要はない.

source: It allows for the use of an extensible variety of symmetric cipher algorithms to provide confidentiality for data in transit.
ja: 転送中のデータの機密性を提供するため, 対称暗号アルゴリズムを拡張して利用できる.

source: Another form of proxy forwarding provided by the SSH connection protocol is the forwarding of the X11 protocol.
ja: SSH コネクションプロトコルが提供するプロキシ転送の別の形式が, X11 プロトコルの転送だ.

source: AES-GCM is an example of an "algorithm for authenticated encryption with associated data" (AEAD algorithm) as described in [RFC5116].
ja: AES-GCM は, [RFC5116] で記述された "algorithm for authenticated encryption with associated data" (関連するデータの認証付き暗号化を行なうアルゴリズム, AEAD アルゴリズム) の例だ.

source: Outgoing messages specified with a securityLevel of noAuthNoPriv or authNoPriv are actually sent by the SSH Transport Model with authPriv-level protection.
ja: noAuthNoPriv や authNoPriv のセキュリティレベルで指定された送信メッセージは, 実際には authPriv レベルの保護で SSH トランスポートモデルから送られる.

source: A second service request is sent after client authentication is complete.
ja: 2番目のサービスの要求は, クライアント認証が完了してから送られる.

source: Public Key File Body
ja: 公開鍵ファイルの本体

source: At some future time, it is expected that another algorithm, one with better strength, will become so prevalent and ubiquitous that the use of "3des-cbc" will be deprecated by another STANDARDS ACTION.
ja: 近い将来において, より強度の高い別のアルゴリズムが広く普及して, 別の STANDARDS ACTIONによって"3des-cbc'の利用が非推奨となるだろう.

source: ECDH Key Exchange Method Names (ecdh-sha2-*)
ja: ECDH 鍵交換法の名前 (ecdh-sha2-*)

source: type-specific data follows
ja: タイプに特有のデータが続く.

source: o Encryption key server to client: HASH(K || H || "D" || session_id)
ja: o サーバからクライアントへの暗号鍵: HASH(K || H || "D" || session_id)

source: The server MUST process each request completely and acknowledge any failed requests with a SSH_MSG_USERAUTH_FAILURE message before processing the next request.
ja: サーバは, それぞれの要求を完全に処理しなければならない. また, 失敗した要求があった場合には, 次の要求を処理する前に SSH_MSG_USERAUTH_FAILURE メッセージで通知しなければならない.

source: In particular, host key sizes, hashing algorithms and bulk encryption algorithms must be chosen appropriately.
ja: 特に ホスト鍵のサイズとハッシュアルゴリズムとバルク(任意長)暗号化アルゴリズムは, 適切に選択しなければならない.

source: Additional algorithms, methods, formats, and extension protocols can be defined in separate documents.
ja: 追加のアルゴリズム, 方式, フォーマット, 拡張プロトコルは, 別のドキュメントで定義されることがある.

source: Implementations MAY provide additional methods for verifying the correctness of host keys, e.g., a hexadecimal fingerprint derived from the SHA-1 hash [FIPS-180-2] of the public key.
ja: 装はホスト鍵の正当性を検証する追加の方法を提供してもよい. たとえば, 公開鍵のSHA-1ハッシュ [FIPS-180-2] の16進の指紋だ.

source: Secure Shell defines a user authentication mechanism that is based on public keys, but does not define any mechanism for key distribution.
ja: セキュアシェルは公開鍵の基づくユーザ認証アルゴリズムを定義しているが, 鍵配布のメカニズムは定義していない.

source: Each certificate and ocsp-response MUST be encoded as a string of octets using the Distinguished Encoding Rules (DER) encoding of Abstract Syntax Notation One (ASN.1) [ASN1].
ja: それぞれの certificate と ocsp-response は, Abstract Syntax Notation One (ASN.1) [ASN1] の Distinguished Encoding Rules(DER) エンコーディングを用いてオクテット文字列としてエンコードされなければならない.

source: Comment Header
ja: Comment ヘッダ

source: This document also describes some of the client interaction with the user in obtaining the authentication information.
ja: この文書は, 認証の情報を得る際のユーザとクライアントのやりとりについても記述する.

source: The security of the SSH protocols relies on the verification of public host keys.
ja: SSHプロトコルのセキュリティは, 公開ホスト鍵の検証に依存している.

source: National Institute of Standards and Technology (NIST) Special Publication SP 800 38D [GCM] gives an excellent explanation of Galois Counter Mode.
ja: National Institute of Standards and Technology (NIST) Special Publication SP 800 38D [GCM] が, Galois カウンタモードの素晴しい説明をしている.

source: o If the key exchange fails due to a GSS-API error returned from the client's call to GSS_Init_sec_context(), and an "error token" is also returned, then the client SHOULD send the error token to the server to allow completion of the GSS security exchange.
ja: o クライアントのGSS_Init_sec_context()で GSS-API エラーが返ったことによって鍵交換が失敗し"エラートークン"も返されたならあ, クライアントはサーバにGSSセキュリティ交換の完了を許可するためにエラートークンを送る必要がある.

source: It computes e = g^x mod p, and sends "e" to S.
ja: e = g^x mod p を計算し "e" を S に送る.

source: As an additional note, when one of the stateful-decryption counter mode encryption methods (Section 4) is used, then the padding included in an SSH packet (Section 4 of [RFC4253]) need not be (but can still be) random.
ja: 追加の注意として, (4節の)ステートフル復号カウンターモード暗号法の1つを使う場合, ([RFC4253]の4節)のSSHのパケットに含まれるpaddingはランダムでなくてもよい(ただしランダムのままでもよい).

source: The SNMP-TARGET-MIB module [RFC3413] contains objects for defining these management targets, including transport domains and addresses and security parameters, for applications such as notification generators and proxy forwarders.
ja: SNMP-TARGET-MIB モジュール [RFC3413] は, 通知の発信者やプロキシの転送者のようなアプリケーションのために, トランスポートのドメインとアドレスとセキュリティパラメータを含む, これらの管理のターゲットを定義するオブジェクトを含んでいる.

source: The IANA will not assign Disconnection Message 'reason code' values in the range of 0xFE000000 through 0xFFFFFFFF.
ja: IANAは, 0xFE000000 から 0xFFFFFFFF の範囲の 切断メッセージの'reason code' の値は割り当てない.

source: Motivation
ja: 動機

source: The SSH_MSG_USERAUTH_INFO_REQUEST message is defined as follows:
ja: SSH_MSG_USERAUTH_INFO_REQUEST メッセージは次のように定義される.

source: The "serpent256-ctr" method uses Serpent with 256-bit keys.
ja: "serpent256-ctr" は 256-bit 鍵を用いる Serpent を使う.

source: The password mechanism, as specified in the authentication protocol, assumes that the server has not been compromised.
ja: 認証プロトコルで定義されるパスワードのメカニズムは, サーバが侵害されていないことを前提とする.

source: All messages sent after this message MUST use the new keys and algorithms.
ja: このメッセージの後のすべてのメッセージは, 新しい鍵とアルゴリズムで送られなければならない.

source: Rekeying Considerations
ja: 鍵の再発行の考察

source: Listing Server Capabilities .
ja: サーバ機能の一覧の取得 .

source: Packet Size and Overhead
ja: パケットのサイズとオーバーヘッド

source: Channel Bindings
ja: チャンネルの束縛

source: The method uses the following messages.
ja: この方法は以下のメッセージを用いる.

source: GSS-API-Authenticated Diffie-Hellman Key Exchange
ja: GSS-API に認証された Diffie-Hellman 鍵交換

source: Information on the REQUIRED and RECOMMENDED elliptic curve domain parameters for use with this method can be found in Section 10.
ja: この方法で利用する必須および推奨の楕円曲線ドメインパラメータに関する情報は、 10節にある.

source: Also, if the contents of these files are transferred it SHOULD be done over a trusted channel.
ja: 加えて, これらのファイルの内容を転送する際は, 信頼されたチャンネル上で行なわれる必要がある.

source: Required Curves ..........................................16 10.2.
ja: 必須の曲線 ..........................................16 10.2.

source: Diffie-Hellman Group and Key Exchange
ja: Diffie-Hellman 群と鍵交換

source: The server's last input is in SSH_MSG_KEXRSA_PUBKEY, before it has seen the client's choice of K. The client's last input is K and its RSA encryption, and the one-way nature of RSA encryption should ensure that the client cannot choose K so as to cause a collision.
ja: サーバの最終の入力は SSH_MSG_KEXRSA_PUBKEY にある. これは クライアントが K を選ぶのを見るより前に送られる. クライアントの最後の入力は K と その RSA暗号化で, RSA 暗号の一方向性から衝突を起こす K をクライアントが選べないことが保証されている.

source: NETCONF is used to access configuration and state information and to modify configuration information, so the ability to access this protocol should be limited to users and systems that are authorized to view the agent's configuration and state or to modify the agent's configuration.
ja: NETCONF は, 設定や状態の情報にアクセスし, 設定情報を変更する. このため, このプロトコルにアクセスする能力は, エージェントの設定や状態を閲覧したりエージェントの設定を変更する権限のあるユーザやシステムに制限される必要がある.

source: The security of the connection relies on the server authenticating itself to the client as well as the user authenticating itself to the server.
ja: 接続のセキュリティは, クライアントに対するサーバの認証とサーバに対するユーザの認証双方に依存している.

source: cookie The 'cookie' MUST be a random value generated by the sender.
ja: cookie 'cookie' は, 送り手が生成するランダムな値でなければならない.

source: Opening a Channel
ja: チャンネルの開始

source: This document describes the architecture of the SSH protocol, as well as the notation and terminology used in SSH protocol documents.
ja: この文書は, SSHのプロトコルのアーキテクチャを記述している. また, SSHのプロトコルのドキュメントで使われる表記法や用語も記述している.

source: Note: in [RFC5116], the IV is called the nonce.
ja: 注意: [RFC5116] では IV はナンスと呼ばれている.

source: Authentication in this protocol level is host-based; this protocol does not perform user authentication.
ja: このプロトコルレベルでの認証は, ホストベースだ. このプロトコルはユーザ認証を実施しない.

source: MIB Module Definition ..........................................22 8.
ja: MIB Module の定義 ..........................................22 8.

source: This section defines the family of "ecdsa-sha2-*" public key formats and corresponding signature formats.
ja: この節では, "ecdsa-sha2-*" ファミリーの公開鍵フォーマットと対応する署名フォーマットを定義する.

source: Data integrity is protected by including with each packet a MAC that is computed from a shared secret, packet sequence number, and the contents of the packet.
ja: それぞれのパケットにMACが含まれるとによりデータの完全性が保護される. MACは, 共有の秘密, パケットのシーケンス番号, パケットの中身から計算される.

source: This protocol assumes that the underlying protocols provide integrity and confidentiality protection.
ja: このプロトコルは, その下層のプロトコルが完全性と機密性を提供することを前提とする.

source: If a host not in this list attempts to use this key for authorization purposes, the authorization attempt MUST be denied.
ja: このリストに含まれないホストが認証目的でこの鍵を利用しようとしたら, 認証の試行は拒否されなければならない.

source: Subsystem names follow the DNS extensibility naming convention outlined in [SSH-NUMBERS].
ja: サブシステムの名前は, [SSH-NUMBERS] で説明されている DNS 拡張命名規則に従う.

source: The first is an example of challenge/response with a handheld token.
ja: 最初は, ハンドヘルドトークンによるチャレンジ/レスポンスの例だ.

source: Binary Packet Protocol ..........................................7 6.1.
ja: バイナリパケットプロトコル..................................7 6.1.

source: The connection SHOULD be re-established if this occurs.
ja: この時, 接続は再度構築する必要がある..

source: The SSH protocol supports the use of public/private key pairs in order to perform authentication based on public key cryptography.
ja: SSH プロトコルは, 公開鍵暗号をベースとする認証を実行するために公開/秘密鍵ペアを利用する.

source: In keeping with the RFC 3411 design decision to use self-contained documents, this document defines the elements of procedure and associated MIB module objects that are needed for processing the Secure Shell Transport Model for SNMP.
ja: 自己完結する文書を用いるという RFC3411 の設計の決定に従い, この文書は, SNMP のためのセキュアシェルトランスポートモデルを処理するのに必要な手順の要素と関連する MIB モジュールオブジェクトを定義する.

source: If a connection is established to a server whose public key is not already known to the client, a fingerprint of the key is presented to the user for verification.
ja: クライアントがまだ知らない公開鍵を持つサーバと接続を確立する場合, 検証のために鍵の指紋がユーザに提示される.

source: 51 ICANON Canonicalize input lines.
ja: 51 ICANON 入力行を正規化する.

source: The attack device will also, simultaneously to this, initiate a session to the legitimate server, masquerading itself as the client.
ja: 攻撃用のデバイスは, これと同時に, 正当なサーバへのセッションを開始する. このとき, デバイスはクライアントのふりをする.

source: Note that, normally, status messages are only sent by the server (in response to requests from the client).
ja: 注意: 通常状態メッセージは(クライアントからの要求への応答として)サーバからのみ送られる.

source: o There is no requirement on the ordering of OCSP responses.
ja: o OCSP 応答の順序に要件はない.

source: This document describes algorithms based on Elliptic Curve Cryptography (ECC) for use within the Secure Shell (SSH) transport protocol.
ja: この文章は, セキュアシェル(SSH) トランスポートプロトコルの中で利用する 楕円曲線暗号(ECC)ベースのアルゴリズムを記述する.

source: There is no requirement that the responses be in any particular order.
ja: 応答は, 特定の順序である必要はない.

source: Multiple sessions can be active simultaneously.
ja: 複数のセッションが同時に有効になりうる.

source: If it does not provide strong integrity protection, requests to change authentication data (e.g., a password change) SHOULD be disabled to prevent an attacker from modifying the ciphertext without being noticed, or rendering the new authentication data unusable (denial of service).
ja: 強い完全性保護が提供されない場合は, (パスワード変更のような)認証データの変更の要求は, 無効にされる必要がある. 攻撃者が警告無しに暗号文を変更したり新しい認証データを利用できないものに変更する(サービス妨害)のを防ぐためだ. (denial of service).

source: The connection still provides protection against passive listening; however, it becomes vulnerable to active man-in-the-middle attacks.
ja: この場合でも接続は受動的な盗聴に対する保護を提供するが, 能動的な中間者攻撃に対しては脆弱になる.

source: There are no mitigating strategies, other than to use host-based authentication in combination with another authentication method.
ja: 別の認証法とホストベースの認証を組合せる以外に, 緩和する方法はない.

source: When this mechanism is used, the special character sequence ]]>]]>, MUST be sent by both the NETCONF client and the NETCONF server after each message (XML document) in the NETCONF exchange.
ja: このメカニズムが利用される場合, 特殊な文字列, ]]>]]> を NETCONF 交換でのそれぞれの XML文書の後で NETCONF クライアントも NETCONF サーバも送らなければならない.

source: The server MUST respond to this message with either SSH_MSG_USERAUTH_FAILURE or with the following:
ja: サーバは, このメッセージに対して SSH_MSG_USERAUTH_FAILURE か 次のメッセージを返さなければならない.

source: Key exchange method, public key algorithm, symmetric encryption algorithm, message authentication algorithm, and hash algorithm are all negotiated.
ja: 鍵交換法, 公開鍵アルゴリズム, 対称暗号アルゴリズム, メッセージ認証アルゴリズム, ハッシュアルゴリズムはすべて交渉によって決まる.

source: The most-preferred method is the first in the list.
ja: もっとも優先する方法がリストの先頭だ.

source: These are US-ASCII strings of maximum length 64 characters and are case-insensitive.
ja: 最大 64文字で大文字小文字を区別しない US-ASCII 文字列だ.

source: SSH ECC Public Key Algorithm
ja: SSH 楕円曲線暗号公開鍵アルゴリズム

source: The SSH Transport Model of an SNMP engine will perform the translation between SSH-specific security parameters and SNMP- specific, model-independent parameters.
ja: SNMP エンジンの SSH トランスポートモデルは, SSH 特有のセキュリティパラメータと SNMP 特有のモデルには独立なパラメータとの変換を行なう.

source: The client generates a string of random bytes, K, encrypts it using K_T, and sends the result back to the server, which decrypts it.
ja: クライアントはランダムなbyte列 K を生成し, K_T を用いて暗号化する. そしてサーバに暗号文を送り, サーバはそれを復号する.

source: Data types used in describing protocol messages are defined in Section 5 of [RFC4251].
ja: プロトコルメッセージを記述するのに用いるデータタイプは, [RFC4251]の 5節で定義されている.

source: The following table lists the initial assignments of the Connection Protocol Channel Request Names.
ja: 次の表で, コネクションプロトコルのチャンネルのリクエスト名の初期の割り当てを示す.

source: The only reason to reserve additional types is to increase security.
ja: 追加のタイプを予約するために理由として認められるのは, セキュリティが向上することだけだ.

source: Forward Secrecy ....................................20 9.3.8.
ja: 前方秘密性 ....................................20 9.3.8.

source: MIB objects are generally accessed through the Simple Network Management Protocol (SNMP).
ja: MIB オブジェクトは, シンプルネットワークマネジメントプロトコル(SNMP) により一般にアクセスされる.

source: During algorithm negotiation with the SSH_MSG_KEXINIT messages, the ECMQV key exchange method can only be chosen if a public key algorithm supporting ECC host keys can also be chosen.
ja: SSH_MSG_KEXINIT メッセージを用いる アルゴリズムネゴシエーションにおいて, ECCホスト鍵をサポートする公開鍵アルゴリズムが選ばれた場合のみECMQV 鍵交換法は選択されうる.

source: Whenever possible, it is RECOMMENDED that the server perform additional checks to verify that the network address obtained from the (untrusted) network matches the given client host name.
ja: (信用されない)ネットワークから得られたネットワークのアドレスとクライアントのホスト名が一致するかどうかの検証を, 可能な場合いつでもサーバが追加のチェックとして行なうことが推奨される.

source: This document describes the methods used to perform key exchange and user authentication in the Secure Shell protocol using the GSS-API.
ja: この文書は, GSS-APIを用いてセキュアシェルプロトコルで鍵交換とユーザ認証を行なう方法を記述する.

source: Use of the Packet Sequence Number in the AT ................8 8.2.
ja: AT でのパケットシーケンス番号の利用 ................8 8.2.

source: On single-user systems, it might be reasonable to default to allow the local display to open over TCP/IP.
ja: シングルユーザのシステムでは, デフォルトでローカルディスプレイをTCP/IP上でオープンすることが合理的かもしれない.

source: Fingerprint .........................................5 3.2.
ja: 指紋 .........................................5 3.2.

source: This eliminates the need to generate cryptographically secure pseudorandom bytes for each packet.
ja: パケットごとに暗号学的に安全な疑似乱数バイト列を生成する必要がなくなる.

source: The RR type code for the SSHFP RR is 44.
ja: SSHFP RR の RR タイプコードは 44 だ.

source: As a result, it may be necessary to provision authentication credentials on the SNMP engine containing the notification originator or to use a third-party key provider, such as Kerberos, so the engine can successfully authenticate to an engine containing a notification receiver.
ja: 結果として, SNMP エンジンが通知の受信者を含むエンジンへの認証を成功するために, 通知の発信者を含む SNMP エンジンに認証の情報を渡す必要があるか, Kerberos のような 第三者鍵プロバイダを用いる必要がある.

source: Examples
ja: 例

source: To authenticate the server, the client usually stores pairs (tmTransportAddress, server host public key) in an implementation-dependent manner.
ja: サーバを認証するため, クライアントは実装依存の方法で (tmTransportAddress, サーバホスト公開鍵) のペアを通常保持する.

source: In other words:
ja: 式で表現すると次のようになる:

source: If L is less than 128 (which is the case for older ciphers such as 3DES, Blowfish, CAST-128, and IDEA), then, although it may be too expensive to rekey every 2**(L/4) blocks, it is still advisable for SSH implementations to follow the original recommendation in [RFC4253]: rekey at least once for every gigabyte of transmitted data.
ja: Lが128未満の場合(3DES, Blowfish, CAST-128, IDEAなどの古い暗号の場合), 2**(L/4)ブロックごとの鍵の再生成は非常にコストが高い場合がある. この場合は, [RFC4253] の元々の推奨 (転送データ1GBバイトごとにすくなくとも1回鍵の再生成をする)に従うのがSSHの実装に取って望ましい.

source: The chosen MAC algorithm MUST be the first algorithm on the client's name-list that is also on the server's name-list.
ja: 選択されるMACアルゴリズムは, サーバの名前リストに存在するものの中でクライアントの名前リストの最初にあるアルゴリズムでなければならない.

source: The concatenation of any so encoded ASN.1 OID specifying a set of elliptic curve domain parameters with "ecdh-sha2-" is implicitly registered under this specification.
ja: "ecdh-sha2-" と連結される 楕円曲線ドメインパラメータの集合を指定する ASN.1 OID は, この仕様の元で暗黙的に登録される.
